// Задание 1
// Преобразуйте строку js в верхний регистр JS.




// Задание 2
// Создайте функцию, которая в качестве параметров принимает массив строк и строку. 
// Возвращать данная функция должна новый массив, содержащий только те элементы переданного массива, 
// которые начинаются с переданной строки. Регистр символов не должен влиять.



// Задание 3
// Округлите число 32.58884:
// 1. До меньшего целого
// 2. До большего целого
// 3. До ближайшего целого




//  Задание 4
// Даны числа 52, 53, 49, 77, 21, 32. Необходимо найти среди этих чисел наименьшее и наибольшее числа и вывести их в консоль.




// Задание 5
// Создайте функцию, которая будет выводить в консоль рандомное число от 1 до 10.




// Задание 6
// Напишите функцию, которая будет принимать на вход целое число, 
// а возвращать массив случайных целых чисел от 0 до переданного числа. 
// Длина массива должна быть в 2 раза меньше переданного числа.




// Задание 7
// Напишите функцию, которая на вход принимает 2 целых числа, 
// а в качестве результата возвращает случайное целое число в этом диапазоне.



// Задание 8. 
// Выведите в консоль текущую дату в стандартном режиме. Используйте один из трех рассмотренных в уроке способов.


// Задание 9.
// Создайте переменную currentDate и сохраните в нее текущую дату. Выведите дату, которая наступит через 73 дня после текущей.


// Задание 10
// Написать функцию, которая на вход принимает дату, а возвращает ее отображение в виде:
// Дата: <число> <месяц на русском> <год> - это <день недели на русском>.
// Время: <часы>:<минуты>:<секунды>
// Время, которое будет выведено, также хранится в объекте Date.

